In [4]:
import sqlite3

In [5]:
con = sqlite3.connect("students1.sqlite3")

In [6]:
cur = con.cursor()

In [7]:
CREATE_TABLE_QUERY = """
CREATE TABLE student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null
);
"""
cur.execute(CREATE_TABLE_QUERY)

OperationalError: table student already exists

In [8]:
INSERT_RECORDS = """
INSERT INTO student
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
VALUES
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 23, 'm', 'CSIT'),
(3, 'esha', 'bhaktapur', 'ismt', 22, 'f', 'IT'),
(4, 'nayna', 'pokhara', 'tu', 23, 'f', 'CE');
"""
cur.execute(INSERT_RECORDS)

IntegrityError: UNIQUE constraint failed: student.id

In [9]:
con.commit()

In [10]:
students = cur.execute("SELECT * FROM student;")
print(students)

<sqlite3.Cursor object at 0x0000027E4F146540>

In [11]:
students = cur.execute("SELECT * FROM student;")
for student in students:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 23, 'm', 'CSIT')
(3, 'esha', 'bhaktapur', 'ismt', 22, 'f', 'IT')
(4, 'nayna', 'pokhara', 'tu', 23, 'f', 'CE')

In [12]:
students = cur.execute("SELECT * FROM student WHERE address = 'lalitpur';")
for student in students:
    print(student)

(2, 'shyam', 'lalitpur', 'islington', 23, 'm', 'CSIT')

In [13]:
#address = input("Enter the address")
#students = cur.execute(f"SELECT * FROM students WHERE address = '{address}';")
#for student in students:
 #   print(student)

#output ma kathmandu garyo vane tesko result dinchha

In [14]:
#address = input("Enter the address")
#students = cur.execute(f"SELECT * FROM students WHERE address = '{address}';")
#for student in students:
 #   print(student) 
#sql inject vanchha eslai esle garera data leakage hunchha which is bad
# output ma lalitpur' or 'kathmandu diyo vane dubai dinchha == {address}

In [15]:
#address = input("Enter the address")
#students = cur.execute(f"SELECT * FROM students WHERE address = ?;" '(address,)) 
#yo case ma chai jati pani sql inject garna khojey pani lidaina
#for student in students:
 #   print(student)

In [20]:
student = cur.execute(f"""alter table student and column university varchar default 'TU';""")
con.commit()

OperationalError: near "and": syntax error

In [21]:
student = (11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', "IT", "TU")
INSERT_RECORDS = """
INSERT INTO student
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
VALUES
(?,?,?,?,?,?,?,?)
"""
cur.execute(INSERT_RECORDS, student)
con.commit()

OperationalError: table student has no column named university

In [ ]:
students = [
    (113, 'hari bahadur','lalitpur', 'ncit', 23, 'm', "SE","PU"),
    (114, 'madan bahadur', 'bhaktapur', 'ismt', 22, 'm', "CE", "TU")

INSERT_RECORDS = """
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
VALUES
(?,?,?,?,?,?,?,?)
"""
cur.execuremany(INSERT_RECORDS, students) #insert at once => bulk
con.commit()